# -*- coding: utf-8 -*-
# UTF-8 encoding when using korean

input()
print(' '.join(map(str, sorted(map(int, input().split() + input().split()))))+' ')

"""
문제주소 : https://level.goorm.io/exam/43250/%EB%B0%B0%EC%97%B4-%ED%95%A9%EC%B9%98%EA%B8%B0/quiz/1
시간 : 3분


다른 사람 풀이 :
========================================================================================

========================================================================================

노트 :
- 구름 플랫폼 출력에 예민함 - ex 뒤에 띄어쓰기 까지 일치시켜야함
"""