n = int(input())

"""
1*2  2*1 2*2

n*2

n-1 *2 * 1
n-2 *2 * 2

1 : 1
2 : 3
3 : 5

f(n) = f(n-1) + 2f(n-2)
"""

answerList = [1, 3]

for i in range(n):
    if i > 1:
        answerList.append(answerList[i-1] + 2 * answerList[i-2])


print(answerList[n-1])


"""
문제 : p201 떡볶이 떡 만들기
시간 : 5분

접근 :

다른 사람 풀이 :
========================================================================================
해설 :
========================================================================================

노트 :

"""