location = input()

x = ord(location[0]) - ord('a') + 1
y = int(location[1])

dx = [1, 1, -1, -1, 2, 2, -2, -2]
dy = [2, -2, 2, -2, 1, -1, 1, -1]

count = 0

for i in range(8):
    if 1 <= x + dx[i] <= 8 and 1 <= y + dy[i] <= 8:
        count += 1

print(count)


"""
문제 : p115_왕실의 나이트
시간 : 6분 30초

접근 :
이동할 수 있는 8가지 방향을 정의해놓고 사용하는 방법을 ㅗ풀이


다른 사람 풀이 :
========================================================================================

steps = [(-2, -1), (-1, -2), (1, -2), (2, -1), (2, 1), (1, 2), (-1, 2), (-2, 1)]

for step in steps:
    next_row = row + step[0]
    next_column = column + step[1]

========================================================================================

노트 :

"""